wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
    if(OF_Prefs::InitFS() == OF_Prefs::Error_Success) {
        //OF_Prefs::ResetPreferences(); // ============ FORMATTA IL FILE SYSTEM =================================
        OF_Prefs::LoadProfiles();
    
        // Profile sanity checks
        // resets offsets that are wayyyyy too unreasonably high
        for(int i = 0; i < PROFILE_COUNT; ++i) {
            if(OF_Prefs::profiles[i].topOffset >= 32768     || OF_Prefs::profiles[i].topOffset <= -32768 ||
               OF_Prefs::profiles[i].bottomOffset >= 32768  || OF_Prefs::profiles[i].bottomOffset <= -32768 ||
               OF_Prefs::profiles[i].rightOffset >= 32768   || OF_Prefs::profiles[i].rightOffset <= -32768 ||
               OF_Prefs::profiles[i].leftOffset >= 32768    || OF_Prefs::profiles[i].leftOffset <= -32768) {
                OF_Prefs::profiles[i].topOffset = 0;
                OF_Prefs::profiles[i].bottomOffset = 0;
                OF_Prefs::profiles[i].leftOffset = 0;
                OF_Prefs::profiles[i].rightOffset = 0;
            }
        
            if(OF_Prefs::profiles[i].irSens > DFRobotIRPositionEx::Sensitivity_Max)
                OF_Prefs::profiles[i].irSens = DFRobotIRPositionEx::Sensitivity_Default;

            if(OF_Prefs::profiles[i].runMode >= FW_Const::RunMode_Count)
                OF_Prefs::profiles[i].runMode = FW_Const::RunMode_Normal;
        }

        // if selected profile is out of range, fallback to a default instead.
        if(OF_Prefs::currentProfile >= PROFILE_COUNT)
            OF_Prefs::currentProfile = 0;

        // set the run mode
        if(OF_Prefs::profiles[OF_Prefs::currentProfile].runMode < FW_Const::RunMode_Count)
            FW_Common::runMode = (FW_Const::RunMode_e)OF_Prefs::profiles[OF_Prefs::currentProfile].runMode;

        OF_Prefs::Load();
        
        #if defined(OPENFIRE_WIRELESS_ENABLE) && defined(ARDUINO_ARCH_ESP32)
            
            if (OF_Prefs::LoadLastDongleWireless(lastDongleAddress, &lastDongleChannel) == OF_Prefs::Error_Success) lastDongleSave = true;
                else lastDongleSave = false;
            
            if (OF_Prefs::LoadLastPedalWireless(lastPedalAddress, &lastPedalChannel) == OF_Prefs::Error_Success) lastPedalSave = true;
                else lastPedalSave = false;

        #endif // defined(OPENFIRE_WIRELESS_ENABLE) && defined(ARDUINO_ARCH_ESP32)
        
    } else Serial.printf("%c%c (No Storage Available)", OF_Const::sError, (char)OF_Prefs::Error_NoStorage);
    
    

// ===================================================================================
// IDENTITA' DINAMICA USB (SPOOFING SHADOWING)
// ===================================================================================
// Prepariamo l'identità della periferica. Se siamo in modalità Wireless, questi 
// dati verranno inviati al Dongle affinché possa fingersi questa specifica pistola. 
// Se siamo via Cavo, configureremo il nostro TinyUSB locale con questi stessi parametri.

    // ===== [ESP32_PORT] per trasmettere i dati wireless al dongle ========
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
        strncpy(usb_data_wireless.deviceManufacturer,MANUFACTURER_NAME,sizeof(usb_data_wireless.deviceManufacturer));
        strncpy(usb_data_wireless.deviceName,DEVICE_NAME, sizeof(usb_data_wireless.deviceName)); // cambia
        usb_data_wireless.deviceVID = DEVICE_VID;
        #ifdef PLAYER_NUMBER
            usb_data_wireless.devicePID = PLAYER_NUMBER; // cambia
            usb_data_wireless.devicePlayer = PLAYER_NUMBER;
        #else
            usb_data_wireless.devicePID = 1; //PLAYER 1 DEFAULT
            usb_data_wireless.devicePlayer = 1; // PLAYER 1 DEFAULT
        #endif // PLAYER_NUMBER
        usb_data_wireless.channel = espnow_wifi_channel;
    #endif // defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
    // ===============================================================

 
    // We're setting our custom USB identifiers, as defined in the configuration area!
    #ifdef USE_TINYUSB
        // Initializes TinyUSB identifier
        if (!TinyUSBDevice.isInitialized()) { // [ESP32_PORT] aggiunto ..funzionava lo stesso, ma così è più sicuro .. sicuramente serve per Esp32 con libreria non integrfata nel core
            TinyUSBDevice.begin(0);
        }
        // Values are pulled from EEPROM values that were loaded earlier in setup()
        TinyUSBDevice.setManufacturerDescriptor(MANUFACTURER_NAME);

        if(OF_Prefs::usb.devicePID) {
            TinyUSBDevice.setID(DEVICE_VID, OF_Prefs::usb.devicePID);
            #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
                usb_data_wireless.devicePID = OF_Prefs::usb.devicePID;
                usb_data_wireless.devicePlayer = OF_Prefs::usb.devicePID;
            #endif // defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)    
            if(OF_Prefs::usb.deviceName[0] == '\0')
                 TinyUSBDevice.setProductDescriptor(DEVICE_NAME);
            else {
                TinyUSBDevice.setProductDescriptor(OF_Prefs::usb.deviceName);
                #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
                    strncpy(usb_data_wireless.deviceName, OF_Prefs::usb.deviceName, sizeof(usb_data_wireless.deviceName));
                #endif // defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)    
            }
        } else {
            TinyUSBDevice.setProductDescriptor(DEVICE_NAME);
            TinyUSBDevice.setID(DEVICE_VID,
            #ifdef PLAYER_NUMBER
            PLAYER_NUMBER
            #else
            1
            #endif // PLAYER_NUMBER
            );
        }

#endif //USE_TINYUSB

// ====== [ESP32_PORT] ==== questo blocco per opportunità è spostato sopra prima della connessione =======

    // this is needed for both customs and builtins, as defaults are all uninitialized
    FW_Common::UpdateBindings(true);

    // Initialize DFRobot Camera Wires & Object
    FW_Common::CameraSet();

    // initialize buttons & feedback devices
    FW_Common::buttons.Begin();
    FW_Common::FeedbackSet();

    #ifdef LED_ENABLE
        OF_RGB::LedInit();
    #endif // LED_ENABLE
// ====== [ESP32_PORT] ==== fine del blocco che per opportunità è spostato sopra prima della connessione =======

// ===================================================================================
// CALIBRAZIONE EMPIRICA HARDWARE DEGLI STICK ANALOGICI
// ===================================================================================
// Invece di affidarci a valori di deadzone hardcodati (che variano per usura 
// dei potenziometri, molla meccanica o tolleranze di fabbrica), blocchiamo il sistema 
// per 2 secondi all'avvio. Registriamo fisicamente il "rumore" di fondo dello stick 
// a riposo per stabilire un centro e limiti di sicurezza personalizzati dinamicamente.

    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    // [ESP32_PORT] == CODICE PER CALIBRARE LEVETTA STICK IN POSIZIONE CENTRALE =============
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    #if defined(ARDUINO_ARCH_ESP32) && defined(USES_ANALOG)   // la facciamo solo per ESP32 e lasciamo RP2040 come gestione originale
        
