wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
    #ifdef USES_DISPLAY
        unsigned long lastChange = 0;
        int8_t currentIndex = 0;
        int8_t direzione = 1;
        const char* word = "...CALIBRATION...";
        const uint8_t baseX = 10;
        const uint8_t baseY = 2;
        const uint8_t charWidth = 6;
        uint8_t len_word;
    if(display_OLED != nullptr) {    
        display_OLED->setCursor(baseX, baseY);
        display_OLED->setTextSize(1);
        display_OLED->setTextColor(WHITE, BLACK);
        display_OLED->fillRect(0, 0, 128, 16, BLACK);
        display_OLED->drawFastHLine(0, 15, 128, WHITE);
        display_OLED->print(word);
        display_OLED->display();
        len_word=strlen(word);
    }
    #endif // USES_DISPLAY
    
    uint16_t analogValueX;
    uint16_t analogValueY;
       
    unsigned long startTime = millis();
    while ((millis()-startTime) < 2000) // 2000
    {
        analogValueX = analogRead(OF_Prefs::pins[OF_Const::analogX]);
        analogValueY = analogRead(OF_Prefs::pins[OF_Const::analogY]);
        if (analogValueX > ANALOG_STICK_DEADZONE_X_MAX) ANALOG_STICK_DEADZONE_X_MAX = analogValueX;
        if (analogValueX < ANALOG_STICK_DEADZONE_X_MIN) ANALOG_STICK_DEADZONE_X_MIN = analogValueX;
        if (analogValueY > ANALOG_STICK_DEADZONE_Y_MAX) ANALOG_STICK_DEADZONE_Y_MAX = analogValueY;
        if (analogValueY < ANALOG_STICK_DEADZONE_Y_MIN) ANALOG_STICK_DEADZONE_Y_MIN = analogValueY;

        #ifdef USES_DISPLAY
        if(display_OLED != nullptr) {
            if (millis() - lastChange > 50) {
                display_OLED->setTextColor(BLACK, BLACK);
                display_OLED->setCursor(baseX + (currentIndex * charWidth), baseY);
                display_OLED->write(word[currentIndex]);
                if ((currentIndex > 0) && (currentIndex < (len_word-1)))  {
                    display_OLED->setCursor(baseX + ((currentIndex-direzione) * charWidth), baseY);
                    display_OLED->setTextColor(WHITE, BLACK); 
                    display_OLED->write(word[currentIndex-direzione]);
                }
                display_OLED->display();
                currentIndex = currentIndex + direzione;
                if ((currentIndex == (len_word-1)) || (currentIndex == 0)) direzione *= -1;
                lastChange = millis();
            }
        }
        #endif // USES_DISPLAY
    }
    #ifdef USES_DISPLAY
        FW_Common::OLED.TopPanelUpdate(" CALIBRATION READY "); 
    #endif //USES_DISPLAY

    // ===================================================================================
    // CALCOLO DEL CENTRO MECCANICO PURO
    // ===================================================================================
    // Il centro va calcolato ORA, basandosi solo sul rumore grezzo della molla.

    ANALOG_STICK_DEADZONE_X_CENTER = (ANALOG_STICK_DEADZONE_X_MIN + ANALOG_STICK_DEADZONE_X_MAX) / 2; 
    ANALOG_STICK_DEADZONE_Y_CENTER = (ANALOG_STICK_DEADZONE_Y_MIN + ANALOG_STICK_DEADZONE_Y_MAX) / 2; 
    
    // Espansione di tolleranza (buffer zona morta) per assorbire piccoli rimbalzi meccanici   
    // Espansione di tolleranza con PROTEZIONE (Clamping)
    // Sottraiamo/Aggiungiamo 400 ma forziamo il risultato a rimanere nel recinto 0-4095
    int buffer = 400; 
    ANALOG_STICK_DEADZONE_X_MIN = constrain((int)ANALOG_STICK_DEADZONE_X_MIN - buffer, 0, 4095);
    ANALOG_STICK_DEADZONE_X_MAX = constrain((int)ANALOG_STICK_DEADZONE_X_MAX + buffer, 0, 4095);
    ANALOG_STICK_DEADZONE_Y_MIN = constrain((int)ANALOG_STICK_DEADZONE_Y_MIN - buffer, 0, 4095);
    ANALOG_STICK_DEADZONE_Y_MAX = constrain((int)ANALOG_STICK_DEADZONE_Y_MAX + buffer, 0, 4095);


    #endif
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    // [ESP32_PORT] == FINE CODICE CALIBRAZIONE STICK ========================================
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// ===================================================================================================================

// ===================================================================================
// CONNECTION ROUTING: WIRED (USB) VS WIRELESS (ESP-NOW)
// ===================================================================================
// Al boot, il sistema attende ~1000ms per capire se è connesso via Cavo a un PC.
// Se l'Host USB monta il dispositivo, la Lightgun sceglierà la porta Seriale fisica. 
// In caso contrario, interpreterà l'assenza di host come "Modalità Batteria", 
// disattivando il driver USB locale e accendendo la radio ESP-NOW per agganciarsi al Dongle.

#ifdef USE_TINYUSB
    #if defined(ARDUINO_RASPBERRY_PI_PICO_W) && defined(ENABLE_CLASSIC)
        // is VBUS (USB voltage) detected?
        if(digitalRead(34) || true) { // [ESP32_PORT] digitalRead(34) non funziona bene ed a mio parere non è un metodo corretto
            // If so, we're connected via USB, so initializing the USB devices chunk.
            TinyUSBDevices.begin(POLL_RATE); // [ESP32_PORT] inserito questo al posto di quello sotto
            // TUSBDeviceSetup.begin(1); // [ESP32_PORT] tolto ancora non fatta completa transizione
            // wait until device mounted
            while(!USBDevice.mounted()) { yield(); }
            Serial.begin(9600);
            Serial.setTimeout(0);
            Serial_OpenFIRE_Stream = &Serial; // [ESP32_PORT] inserito da me
        } else {
            // Else, we're on batt, so init the Bluetooth chunks.
            if(OF_Prefs::usb.deviceName[0] == '\0')
                TinyUSBDevices.beginBT(DEVICE_NAME, DEVICE_NAME);
            else TinyUSBDevices.beginBT(OF_Prefs::usb.deviceName, OF_Prefs::usb.deviceName);
        }   
    #elif defined(ARDUINO_ARCH_RP2040) // [ESP32_PORT] inserito per mantenere vecchio codice
        // Initializing the USB devices chunk.
        TinyUSBDevices.begin(POLL_RATE);
        // wait until device mounted
        while(!USBDevice.mounted()) { yield(); }
        Serial.begin(9600);   // 9600 = 1ms data transfer rates, default for MAMEHOOKER COM devices.
        Serial.setTimeout(0);
        Serial_OpenFIRE_Stream = &Serial; // [ESP32_PORT] inserito da me
    #else // [ESP32_PORT] inserito da me // ARDUINO_ARCH_ESP32
    
    //////////////////////////////////////////////////////////////////////////////////////////////////////////
    // === [ESP32_PORT] === NUOVA GESTIONE INIZIALIZZAIZONE USB O CONNESSIONE WIRELESS ==================== //
    //////////////////////////////////////////////////////////////////////////////////////////////////////////

    TinyUSBDevices.begin(POLL_RATE);
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)   // SE WIRELESS
        #define MILLIS_TIMEOUT  1000 //1 secondi
        unsigned long lastMillis = millis ();
        while ((millis () - lastMillis <= MILLIS_TIMEOUT) && (!TinyUSBDevice.mounted())) { yield(); }
        if (!TinyUSBDevice.mounted()) {
            SerialWireless.init_wireless();
            SerialWireless.begin();
            if (lastDongleSave) {
                // PROVA A CONNETTERTI AL PRECEDENTE DONGLE INVIANDO IL PACCHETTO CHECK_CONNECTION
                if (SerialWireless.connection_gun_at_last_dongle()) {
                } else {
                    SerialWireless.connection_gun();
                }
            }
            else {
                SerialWireless.connection_gun();
            }
        }
    #endif // OPENFIRE_WIRELESS_ENABLE

