wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
    while(!TinyUSBDevice.mounted() && !TinyUSBDevices.onBattery) { yield();}


    // arriva qui solo se e' stato connesso l'usb o e' stata negoziata e stabilita una connessione wireless
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
        #ifdef USES_DISPLAY
            FW_Common::OLED.TopPanelUpdate("  !! LINK READY !! "); 
            vTaskDelay(pdMS_TO_TICKS(1000));
        #endif //USES_DISPLAY
    #endif // defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)

    if (TinyUSBDevice.mounted()) {
        Serial.begin(9600);
        Serial.setTimeout(0);
        #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
            if (TinyUSBDevices.onBattery) {  // nel caso incredibile che l'USB sia montato nel momnto esatto in cui è stata stabilita connessione wireless
                TinyUSBDevices.onBattery = false;
            }
            if (TinyUSBDevices.wireless_mode != WIRELESS_MODE::NONE_WIRELESS) SerialWireless.end();
        #endif 
        Serial_OpenFIRE_Stream = & Serial;

    }  
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
    else {     
        if (!lastDongleSave || 
            (lastDongleSave && (!(memcmp(lastDongleAddress, peerAddress,6) == 0) || !(lastDongleChannel == espnow_wifi_channel)))) OF_Prefs::SaveLastDongleWireless(peerAddress, &espnow_wifi_channel);
        
        
        // CHIUDI TUTTO CIO' CHE E' USB SE E' DA CHIUDERE
        // Salvaguarda la memoria e previene errori del core USB quando non è connesso fisicamente.
        TinyUSBDevice.clearConfiguration();
        TinyUSBDevice.detach();
        
        Serial_OpenFIRE_Stream = &SerialWireless;

        // GESTIONE DEL PEDALE WIRELESS
        if((OF_Prefs::pins[OF_Const::btnPedal] == -1) && (OF_Prefs::pins[OF_Const::btnPedal2] == -1)) {
            if (lastPedalSave && (lastPedalChannel == espnow_wifi_channel)) {
                if (!SerialWireless.connection_gun_at_last_pedal()) SerialWireless.connection_gun_at_pedal();
            } else SerialWireless.connection_gun_at_pedal();
        }
        else {
            // invia segnale al dongle che la procedura del PEDAL è completa
              SerialWireless.tx_gun_at_dongle_pedal_ready();
        }
        
        // salva l'ultimo pedale connesso
        if (TinyUSBDevices.is_pedal_wireless && (!lastPedalSave || 
            (lastPedalSave && (!(memcmp(lastPedalAddress, peerAddress_pedal,6) == 0) || !(lastPedalChannel == espnow_wifi_channel))))) OF_Prefs::SaveLastPedalWireless(peerAddress_pedal, &espnow_wifi_channel);
  
        // ===== FINE GESTIONE DEL PEDALE ================

    }
    #endif

    //////////////////////////////////////////////////////////////////////////////////////////////////////////
    // === [ESP32_PORT] === FINE NUOVA GESTIONE INIZIALIZZAIZONE USB O CONNESSIONE WIRELESS =============== //
    ////////////////////////////////////////////////////////////////////////////////////////////////////////// 
    #endif
#endif //USE_TINYUSB

    // ripristina la parte superiore del diplay come in originale
    #ifdef ARDUINO_ARCH_ESP32
    #ifdef USES_DISPLAY
        FW_Common::OLED.ScreenModeChange(ExtDisplay::ScreenMode_e::Screen_None);
    #endif // USES_DISPLAY
    #endif //ARDUINO_ARCH_ESP32

// ===================================================================================
// POLYMORPHIC I/O: IL TRUCCO DELLA SERIALE VIRTUALE
// ===================================================================================
// Architettura per retrocompatibilità. Ridefinendo la macro `Serial` per 
// puntare al nostro stream dereferenziato (*Serial_OpenFIRE_Stream), l'intera codebase 
// legacy (nata per USB wired) può usare `Serial.print` e `Serial.write` come sempre. 
// I dati verranno instradati via Cavo o via Rete (ESP-NOW) a seconda 
// dell'esito della negoziazione precedente.

    //////////////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////// [ESP32_PORT] ////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////////////
    
    #ifdef OPENFIRE_WIRELESS_ENABLE
        #ifdef Serial
            #undef Serial
        #endif
        #define Serial (*Serial_OpenFIRE_Stream)
    #endif // OPENFIRE_WIRELESS_ENABLE
    
    //////////////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////// [ESP32_PORT] ////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////////////


    // AbsMouse5.init(true); // [ESP32_PORT] rimosso per il mio nuovo OpenFire_TinyDevice

    // IR camera maxes out motion detection at ~300Hz, and millis() isn't good enough
    // L'esecuzione wireless introduce overhead. Ridurre il tick rate della telecamera IR 
    // su batteria (da 5ms a ~15ms) offre più CPU all'ESP-NOW limitando possibili lag di sistema, ma
    // ho riscontrato che funziona comunque bene alla stessa frequenza usata con connessione via cavo,
    // quindi l'ho impostata uguale ovvero 209Hz che corrisponde a circa 5ms
    if (TinyUSBDevices.onBattery) startIrCamTimer(209);  // impostato a 5ms anche per wireless ... es. 100->10ms 66 -> 15ms per connessione wireless
      else startIrCamTimer(209); // 5ms per connessione via cavo
    
    FW_Common::OpenFIREper.source(OF_Prefs::profiles[OF_Prefs::currentProfile].adjX,
                                  OF_Prefs::profiles[OF_Prefs::currentProfile].adjY);
    FW_Common::OpenFIREper.deinit(0);

    // First boot sanity checks; all zeroes are initial config
    if((OF_Prefs::profiles[OF_Prefs::currentProfile].topOffset    == 0 &&
        OF_Prefs::profiles[OF_Prefs::currentProfile].bottomOffset == 0 && 
        OF_Prefs::profiles[OF_Prefs::currentProfile].leftOffset   == 0 &&
        OF_Prefs::profiles[OF_Prefs::currentProfile].rightOffset  == 0)) {

        // This is a first boot! Prompt to start calibration.
        unsigned int timerIntervalShort = 600;
        unsigned int timerInterval = 1000;
        OF_RGB::LedOff();
        unsigned long lastT = millis();
        bool LEDisOn = false;

